---
kind: type
id: T:Autodesk.Revit.DB.AreaTag
source: html/8bbf0942-d7ce-02f0-8e07-aaa6e7aff169.htm
---
# Autodesk.Revit.DB.AreaTag

Provides access to the area topology in Autodesk Revit.

## Syntax (C#)
```csharp
public class AreaTag : SpatialElementTag
```

## Remarks
The areaTag object can be queried for its boundary for use in space planning tools.